export const ActivityData = [
  {
    "title": "检修实验室旧机器",
    "date": "2022-01-12",
    "content": "检修和启用实验室长期闲置的旧机器，用来部署实验室云打印平台、做Linux操作系统内核编译实验，舍友在b站上直播了维修过程并发了一篇新闻：ANL工程师清川、雷帅公益检修实验室闲置计算机。",
    "images": [
      {
        "filename": "p92405464.jpg",
        "width": 1080,
        "height": 498,
        "aspectRatio": 2.17
      }
    ]
  },
  {
    "title": "抵御罗马尼亚黑客攻击",
    "date": "2022-01-14",
    "content": "侦测到组内服务器被罗马尼亚黑客攻击，在宿主机的某容器内植入ethminer以太坊挖矿病毒，并使用leetcode黑话syst3md伪装系统进程。第一次在实战中与黑客和病毒较量，写了一套自动化工具，用来检测黑客后门和恶意程序。",
    "images": [
      {
        "filename": "p92254218.jpg",
        "width": 1080,
        "height": 542,
        "aspectRatio": 1.99
      }
    ]
  },
  {
    "title": "西安防疫政策",
    "date": "2022-01-20",
    "content": "因为西安“层层加码”和“一刀切”的防疫政策，虽然身在低风险地区，却没法回家过年。所谓“层层加码”就是国家允许回西安不允许，西安允许了县上不允许，县上允许了街道不允许，街道允许了小区不让进。",
    "images": []
  },
  {
    "title": "第一次自己写春联",
    "date": "2022-01-29",
    "content": "突发奇想去了趟福州路的美术用品店，买了对联用的红纸和笔墨，第一次自己写春联。对联的内容也是自己写的，上联：二十岁方刚，无负韶华，下联：一万年太久，只争朝夕，横批：不遗余力。贴在了宿舍门上，我觉得我应该是宿舍楼里唯二门上有春联的人，另一个是我舍友。",
    "images": []
  },
  {
    "title": "第二次被黑客攻击",
    "date": "2022-02-06",
    "content": "第二次被黑客攻击，是倾向于自制的野路子，在罗马尼亚生活，阿拉伯裔，有强烈的恐怖主义崇拜，年龄在20岁到30岁之间，拥有一台德国combahton GmbH公司的Linux服务器，常用discord，邮箱terry2002ak@gmail.com，网站seythen.com:1337。",
    "images": [
      {
        "filename": "p92407122.jpg",
        "width": 1080,
        "height": 593,
        "aspectRatio": 1.82
      }
    ]
  },
  {
    "title": "第一次封宿舍",
    "date": "2022-03-09",
    "content": "正片开始。3月8日小道消息说学院开始给教师准备睡袋，3月9日正式通知遣返宿舍，超市泡面一扫而空，大家本着在宿舍待两三天的想法，只把笔记本电脑等必需品带回宿舍。但没想到的是，这波封宿舍至少封了100天。",
    "images": []
  },
  {
    "title": "居家十字弩制作比赛",
    "date": "2022-04-06",
    "content": "为了丰富封控小伙伴们的无聊生活，在朋友圈和水源论坛举办了一个居家十字弩制作比赛，规则是只允许用废旧日用品或者发的抗疫物资。",
    "images": [
      {
        "filename": "p92407198.jpg",
        "width": 1080,
        "height": 810,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "博士生资格考试",
    "date": "2022-04-15",
    "content": "在宿舍封控的情况下参加博士生资格考试——一场没纸、没笔、没书、没打印机甚至有一门没学过的课的、只能参考纸质资料的开卷考试。最后借的笔，用宣纸验算的。",
    "images": []
  },
  {
    "title": "泰拉瑞亚第一次通关",
    "date": "2022-04-16",
    "content": "泰拉瑞亚第一次通关，欧耶\\(^o^)/",
    "images": [
      {
        "filename": "p92408262.jpg",
        "width": 1080,
        "height": 810,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "第一次逛交大植物园",
    "date": "2022-04-22",
    "content": "第一次逛交大植物园，看到了很多不同品种的杜鹃花和抓住春天小尾巴拍照的人。",
    "images": []
  },
  {
    "title": "国际劳动节",
    "date": "2022-05-01",
    "content": "身处疫情风暴的最中心，感慨上海打工人的水深火热，创作了这篇诗歌：国际劳动节。诗里面的意象都从我的生活经历采样，并融合构造了我对上海底层人民生活的想象，比如第一段所描写的小人物“蚁穴里的蜗居”。防疫是抽象的，而每个小人物的痛苦却很具体。对于我们而言，空间上讲“东边月亮、西边月亮”看不出差别，毕竟全世界都在混乱之中；相比之下，每日生活的枯燥绝望却像是永恒不变的东西，所以“昨天月亮、今天月亮好像都一样”。社会面物资紧缺，姐姐和我说她那天只剩下一根胡萝卜了，我就想我们可能都需要学习一下“断齑画粥”的绝学。",
    "images": []
  },
  {
    "title": "噩梦",
    "date": "2022-05-03",
    "content": "做了和生活毫无关系的很奇葩的噩梦。经常做这类梦，比较精彩的就会记下来。<blockquote>思维很混乱，慌张中却提不起力量，我知道他们给我用了药。我躺在手术台上，在90年代的老房间。他高大魁梧，身穿一件洁白的褂子向我走来，问我想好了没有。我支支吾吾不敢说话。- 会儿他被叫走，他老婆来看着我。不像他那么精神焕发，他老婆更像是淳朴的农村人，透出种和蔼。她关上门，我发现门后有一块儿黑板。“这是他照着你的档案抄写的，多优秀的孩子！他总是调查很多，必须得足够优秀。”她开始从头讲解我的人生，仿佛对一切比我还了解。我放松下来，感到很欣慰，这世界有人关注我。</blockquote><blockquote>直到她最后提到这个词“天图〞’，她说，你值得成为天图的一部分，然后笑吟吟走出了门，还是那么和蔼。我的记忆开始闪回，感到无边的恐惧。我看到病房玻璃门外的推车，是一些只漏出惨白头颅的病人，盖着和我颜色一样的毯子。天呐，他们的头只有一半，他们被做了开颅手术！我开始慌张起来。他又进来，领了一群打扮得很上流的年轻男女，他们举着红酒杯进来说说笑笑。突然遇到一个说话很像老朋友的人，开始是问候，突然也以“天图的荣耀”结尾，笑着走了。</blockquote><blockquote>我在想用什么借口逃出去。看到墙角堆了一些衣服，有我丢失已久的灰色羽绒服，有各种曾经莫名其妙遗失的物件。“原来他们一直在潜伏。”他们就等着吃掉我然后烧掉我的物件，做什么超度灵魂的巫毒仪式！我想起外面有两个电梯，现在是在三楼。在一个繁华的商场的背面。外面大概是一个不起眼的小镇。我该不该尿在自己身上？这帮人一定会觉得我恶心，然后叫我去厕所换裤子，我就从窗户逃走。正想着，他又来了，问我想的怎么样。我说我想去厕所（让我担心的是我一点也不想，计划可能失败）。可是令我惊讶的是，他直接欣然同意了。</blockquote><blockquote>穿过客厅，我看到很多上流的男女，穿着西服和黑色礼裙，仍然在精神焕发地交谈。突然我看到几个警察，在和他们干杯！我知道我是赢不了的，报警已无意义。我的家被监视了，我的档案被翻烂了，我无处可逃。我来到他面前，故作激动地告诉他：我愿意。</blockquote>",
    "images": []
  },
  {
    "title": "第一次画钢笔淡彩",
    "date": "2022-05-03",
    "content": "人生第一次画钢笔淡彩，虽然线稿是现成的，但是水彩的质感和颜色的配合都很难把控，总的来说画的不算很失败。",
    "images": [
      {
        "filename": "p92408280.jpg",
        "width": 1080,
        "height": 498,
        "aspectRatio": 2.17
      }
    ]
  },
  {
    "title": "甩温度计",
    "date": "2022-05-10",
    "content": "温度计太紧甩不下去，制作了一个甩温度计的离心机，但后来发现我只要简单计算一下转速就应该知道没效果。同样，我后来在杭州阳了的时候也试了用袜子套着甩，一样的没效果，是温度计坏了。",
    "images": [
      {
        "filename": "p92408291.jpg",
        "width": 1080,
        "height": 810,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "Nand Game",
    "date": "2022-05-13",
    "content": "发掘到一个极好的计算机科普类游戏：Nand，可以让玩家体验从逻辑门电路到制造CPU到开发软件的全过程，唯一的缺点就是门槛太高，我只打到控制机器人走迷宫的汇编程序那块儿就懒得玩儿了。希望有生之年也能做出类似的游戏来。",
    "images": [
      {
        "filename": "p92407393.jpg",
        "width": 1080,
        "height": 534,
        "aspectRatio": 2.02
      }
    ]
  },
  {
    "title": "仿真玩具枪",
    "date": "2022-06-07",
    "content": "因为赶上香樟落叶，萌生了新型仿真玩具枪的设计思路，想做一把能够发射香樟树种子的，和深圳学材料的朋友认真研讨了一下，并着手做了3D模型，但后来发现淘宝上有几乎一样的。",
    "images": [
      {
        "filename": "p92408293.jpg",
        "width": 1080,
        "height": 498,
        "aspectRatio": 2.17
      }
    ]
  },
  {
    "title": "练习欧阳询《九成宫醴泉铭》",
    "date": "2022-06-21",
    "content": "开始断断续续地练习欧阳询的《九成宫醴泉铭》。",
    "images": [
      {
        "filename": "p92408297.jpg",
        "width": 870,
        "height": 652,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "浅读里尔克",
    "date": "2022-06-22",
    "content": "读完了里尔克全集的第一卷第一册，对诗歌创作很有启发，撰写了第一篇诗歌评论：浅读里尔克：灵动的笔调、饱满的情感与纯粹的灵魂。",
    "images": []
  },
  {
    "title": "动态印刷技术",
    "date": "2022-06-24",
    "content": "受b站UP主启发，重新和朋友讨论基于碘钟反应的动态印刷技术，之前没有找到合适的容器，突然发现泡泡纸很合适于是想要着手研究。但后来仔细研究了这项化学反应的性质之后否定了实验的可行性。",
    "images": []
  },
  {
    "title": "穹顶之下",
    "date": "2022-06-27",
    "content": "迎来第一次封校的尾声，创作了诗歌：穹顶之下 - 封校110天，模仿里尔克的笔法。",
    "images": []
  },
  {
    "title": "知乎文章被AI头部公众号头版转载",
    "date": "2022-07-08",
    "content": "知乎文章被AI头部公众号头版转载，此后多篇文章被多个头部公众号陆续转载。",
    "images": [
      {
        "filename": "p92408298.jpg",
        "width": 1080,
        "height": 912,
        "aspectRatio": 1.18
      }
    ]
  },
  {
    "title": "阿里云服务器学生优惠到期",
    "date": "2022-07-10",
    "content": "阿里云服务器学生优惠到期，价格翻了30倍，迁移到腾讯云，因为备案的事情和阿里扯皮。最后选择注销网站，并等待工信部强制注销主体。事实证明，上工信部的空壳主体清除名单并没有什么恶劣的后果。",
    "images": []
  },
  {
    "title": "Mac笔记本的WiFi灌电模块烧了",
    "date": "2022-07-18",
    "content": "用了两年的Mac笔记本的WiFi灌电模块烧了，大概率是因为封校期间长时间外接高刷新率的游戏屏，导致电压不稳烧掉了临近接口的电路。修电脑花了3000块十分心疼，后来数字键盘又失灵了，于是萌生买台式机的想法。",
    "images": []
  },
  {
    "title": "五只胡蜂在空调风扇里面筑巢",
    "date": "2022-07-23",
    "content": "五只胡蜂在空调风扇里面筑巢，最终用杀虫剂消灭。",
    "images": []
  },
  {
    "title": "佩洛西窜访台湾",
    "date": "2022-08-02",
    "content": "佩洛西窜访台湾，大陆舰队围岛演习，破除台海“三八线”。实验室同学们无心学习，群情激愤，全程密切关注。",
    "images": []
  },
  {
    "title": "回家连拔四颗智齿",
    "date": "2022-08-19",
    "content": "回家连拔四颗智齿，手术很顺利。但西安防疫每天六点把人强制叫醒做核酸，是真的让我体力不支。最不能理解的是，这么缺德的事儿后来还发动小学生做志愿者了。",
    "images": []
  },
  {
    "title": "研制清蒸鲈鱼的新配方",
    "date": "2022-08-25",
    "content": "研制清蒸鲈鱼的新配方，一大早逛了两个菜市场才攒齐了柠檬和红彩椒，还淋了一场雨。给鱼认真地用柠檬汁做了spa，改了刀，还专门把它立起来摆了个造型。结果蒸出锅手一滑，鱼翻到水槽里了。它可能想回家了",
    "images": []
  },
  {
    "title": "和妈妈在元朔大桥抓拍水鸟",
    "date": "2022-08-26",
    "content": "和妈妈在元朔大桥抓拍水鸟，剪了一个小视频，非常快乐的一天。",
    "images": []
  },
  {
    "title": "喜提人生第一辆保时捷",
    "date": "2022-09-03",
    "content": "在某夕夕上喜提人生第一辆保时捷！",
    "images": [
      {
        "filename": "p92408301.jpg",
        "width": 1080,
        "height": 548,
        "aspectRatio": 1.97
      }
    ]
  },
  {
    "title": "陕西省历史博物馆",
    "date": "2022-09-08",
    "content": "终于逛了心心念念很多年的陕西省历史博物馆，看到了很多镇馆之宝。很多惟妙惟肖的雕塑和器皿上的小怪兽都既可爱又好笑，感慨一句中华文化的璀璨。",
    "images": []
  },
  {
    "title": "看望一棵皂角树",
    "date": "2022-09-09",
    "content": "去黄土坡上看望一棵皂角树，我二十年的老朋友。从那时起就树干中空，现在却枝繁叶茂。",
    "images": []
  },
  {
    "title": "电动车电池亏电没救了",
    "date": "2022-09-12",
    "content": "电动车电池亏电没救了，烦恼了很久，花了300块换了电池。",
    "images": []
  },
  {
    "title": "第二次封校开始",
    "date": "2022-09-13",
    "content": "我经历的第二次封校开始，据说是学校的第三次。",
    "images": []
  },
  {
    "title": "给宿舍楼办国庆节板报",
    "date": "2022-09-29",
    "content": "被舍友“毛遂他荐”给宿舍楼办板报三小时，收到阿姨和所有过往路人的手动点赞。",
    "images": [
      {
        "filename": "p92408323.jpg",
        "width": 1080,
        "height": 441,
        "aspectRatio": 2.45
      }
    ]
  },
  {
    "title": "实验室入网带宽提升80倍",
    "date": "2022-11-01",
    "content": "在极其艰苦和黑盒的状态下，历时四天，解决了实验室多年以来的历史遗留问题，凭一己之力（还有学长的打下手）将实验室入网带宽提升80倍。同学们评价：功在当代，利在千秋。",
    "images": [
      {
        "filename": "p92407919.jpg",
        "width": 650,
        "height": 600,
        "aspectRatio": 1.08
      }
    ]
  },
  {
    "title": "万神殿",
    "date": "2022-11-05",
    "content": "刷完了万神殿这部计算机相关的科幻动画，虽然上载智能、缸中之脑这类主题在科幻中已经老生常谈，这部动画还是包含了很多不一样的角度，让我第一次能够想象上载智能或强人工智能，对于其自身的存在主义命题的思考。另外，它也相当硬核，一开篇就提到了并行计算里面的哲学家就餐问题。插曲也很好听：Are We Alive?",
    "images": []
  },
  {
    "title": "空闲充电桩分布情况",
    "date": "2022-11-10",
    "content": "利用逆向工程和爬虫，绘制了学校里空闲充电桩分布情况的“群山万壑”图，那几天一直在思考充电桩不足这个现象里面蕴藏的商机。当然，结果是经过反复考证发现，里面没啥商机。逆向工程实际上是2月18号做的，发现了一些比较严重的安全漏洞，但是呢咱也不敢说，就当没有吧。",
    "images": [
      {
        "filename": "p92407927.jpg",
        "width": 800,
        "height": 800,
        "aspectRatio": 1
      }
    ]
  },
  {
    "title": "实验室兄弟们给我准备惊喜",
    "date": "2022-11-12",
    "content": "晚上很晚了回到实验室，发现兄弟们给我准备了惊喜，一个很漂亮的蛋糕。很多人甚至是为了等我才走的这么晚的，当时很感动，有这么一帮好朋友真是人生一大幸事。",
    "images": []
  },
  {
    "title": "卸任CCF上海交大学生分会主席",
    "date": "2022-11-13",
    "content": "卸任CCF上海交大学生分会主席，分会换届迎来了新鲜血液，我也终于可以松一口气了。",
    "images": []
  },
  {
    "title": "里尔克部分诗歌的意象可视化",
    "date": "2022-11-19",
    "content": "研究了很多新闻学、传播学相关的内容，闲暇时用词频统计、共现网络和社区发现做了里尔克部分诗歌的意象可视化，发现生存与死亡是《杜伊诺哀歌》的核心话题。后来又天马行空地想象自己将来开办一个计算机和诗歌交叉的学科要研究哪些课题。",
    "images": []
  },
  {
    "title": "政治风波",
    "date": "2022-11-27",
    "content": "由于乌鲁木齐发生的事情，交大也卷入了政治风波中，除了那些参与其中的人，身边的同学也十分激进。第一次觉得政治离我如此之近，旁观者清、当局者迷，时局十分混乱，还好我最后做出了正确的选择。",
    "images": []
  },
  {
    "title": "青马党校星火培训班结业",
    "date": "2022-11-29",
    "content": "青马党校星火培训班结业，收获良多，并且获评优秀小组长。",
    "images": []
  },
  {
    "title": "江学长永远地离开了我们",
    "date": "2022-11-30",
    "content": "江学长永远地离开了我们，心情极其沉重。开始我并不了解他生平的细节，于是去网上查资料，后来买了传记来读，这才知道我们失去了什么，难过得要哭出来。",
    "images": []
  },
  {
    "title": "人生第一次心理咨询",
    "date": "2022-12-13",
    "content": "人生第一次心理咨询，奈何那天心情太好，没啥感觉。",
    "images": []
  },
  {
    "title": "第一次看世界杯比赛",
    "date": "2022-12-19",
    "content": "第一次看世界杯比赛，就赶上阿根廷踢法国，而且是加时+点球大战，心惊肉跳。梅老板最终捧回大力神杯了了心愿，希望世上的事情都能这么圆满。",
    "images": []
  },
  {
    "title": "元旦四人组",
    "date": "2021-01-01",
    "content": "元旦四人组，和实验室的好兄弟一起写代码跨年~",
    "images": []
  },
  {
    "title": "对Python知识进行差缺补漏",
    "date": "2021-01-19",
    "content": "对Python知识进行差缺补漏，虽然对这门语言很熟悉，但一直没有系统地学习完所有不常见的知识碎片。发表了一篇修改Python内置数据类型属性的教程，打开黑魔法世界大门，此前互联网很少有这方面的资料，此时知乎上只有100+粉丝。",
    "images": []
  },
  {
    "title": "棋谱识别工具",
    "date": "2021-01-28",
    "content": "寒假回家第6天，开发了一套自动将纸质棋谱扫描为电子棋谱的工具，并在知乎记录了两篇系列文章。围棋社的群友恰巧看到了这篇文章，来加我好友，结果发现我们俩实验室挨着，朋友圈也有很大交集。",
    "images": [
      {
        "filename": "p87882173.jpg",
        "width": 720,
        "height": 405,
        "aspectRatio": 1.78
      }
    ]
  },
  {
    "title": "亲自下厨给母亲筹备生日宴",
    "date": "2021-01-31",
    "content": "亲自下厨给母亲筹备生日宴，这次炒回锅肉尝试加了豆豉，简直炒出了灵魂。",
    "images": [
      {
        "filename": "p87882511.jpg",
        "width": 1080,
        "height": 632,
        "aspectRatio": 1.71
      }
    ]
  },
  {
    "title": "修马桶",
    "date": "2021-02-02",
    "content": "修好了家里坏了一个月的马桶，省了150块上门维修费。",
    "images": []
  },
  {
    "title": "拿到驾照",
    "date": "2021-02-03",
    "content": "考完科目四，终于拿到了心心念念的驾照。",
    "images": []
  },
  {
    "title": "开车误入高速",
    "date": "2021-02-07",
    "content": "开车误入高速，想要抄近道掉头下高速，结果车子卡在了绿化带的树桩上。",
    "images": []
  },
  {
    "title": "羊茂山",
    "date": "2021-02-18",
    "content": "终于到访了传说中的羊茂山，那是小时候睡前故事必备的豺狼虎豹出没地。",
    "images": [
      {
        "filename": "p87882784.jpg",
        "width": 1080,
        "height": 808,
        "aspectRatio": 1.34
      }
    ]
  },
  {
    "title": "知乎文章被老师点赞",
    "date": "2021-03-03",
    "content": "出现大乌龙：旁听人工智能的数学基础课，觉得老师有个地方讲的不好，就在知乎上写了一篇详尽的补充材料，并直言不讳地指出了他的缺点。可世界太小了，我的文章一不小心上了优质，然后被系统推送给了他。紧接着他点赞三连，然后转发到了课程群。那一天我涨了很多粉丝，却一直在群里潜水瑟瑟发抖，但最后还是被老师加了好友。很可惜，我觉得这门课讲的太基础了，就没有继续旁听了。",
    "images": []
  },
  {
    "title": "鸽子",
    "date": "2021-03-15",
    "content": "在学校广场上观察鸽子。",
    "images": []
  },
  {
    "title": "加入白岩诗社",
    "date": "2021-03-21",
    "content": "加入白岩诗社，重新找回创作现代诗歌以及表达自我的勇气。这次破冰活动采取一种从文本中选词组诗的方式，非常有趣，结识了很多有趣的灵魂。",
    "images": []
  },
  {
    "title": "大学时代过得到底好不好",
    "date": null,
    "content": "为了分析大学时代过得到底好不好，我使用数据挖掘的方式，将四年的电子版日记进行分词和统计，得到几张词云。研究表明，那段日子并不像我想象的那么晦暗，也有此起彼伏的亮点。<blockquote>柏拉图式的冷夜雨雪霏霏</blockquote><blockquote>哀愁的风声与幽寂赌气</blockquote><blockquote>白色是大地的润肤霜</blockquote><blockquote>在孩子跌撞步伐里结出柚子</blockquote><blockquote>平淡的眼泪不多不少</blockquote><blockquote>樊笼里他乡的颓唐浪子</blockquote><blockquote>是幻想风骨中格格不入的隐喻</blockquote>",
    "images": []
  },
  {
    "title": "读大鹏赋",
    "date": "2021-03-28",
    "content": "读李白的豪情万丈的『大鹏赋』，读到「俄而希有鸟见谓之曰：伟哉鹏乎，此之乐也。」当即难过得大哭了一场。",
    "images": []
  },
  {
    "title": "参加诗人甜河的诗歌分享会",
    "date": "2021-04-04",
    "content": "去城里参加诗人「甜河」的诗歌分享会，精神世界颇为触动：<blockquote>每次读诗都是一种回归和救赎。和禅宗所讲的万物皆空类似，诗歌是抽象精神世界一种不得已的物化，在这种思维漫游中捕风捉影，试图组织贫瘠的语言来表达热烈的灵魂。理工科往往站在逻辑的制高点批评诗人矫揉造作，实际上诗歌的表达是一种勇气。坐在这里看大家毫不羞涩的阐述精神最深处的东西，这种理所当然，其实是一种深度的感动和救赎的享受。</blockquote>",
    "images": []
  },
  {
    "title": "春雨有感",
    "date": "2021-04-11",
    "content": "春雨有感，写下这首赦免令，这也是在网上公开创作诗歌的起始。",
    "images": []
  },
  {
    "title": "在学院大草坪放风筝",
    "date": "2021-04-26",
    "content": "在学院大草坪放风筝，有了风筝结合自动攀绳机器人做高空侦察的奇葩想法。",
    "images": []
  },
  {
    "title": "偷渡浙大找大学的朋友玩耍",
    "date": "2021-04-28",
    "content": "偷渡浙大找大学的朋友玩耍，开始尝试录制VLOG。",
    "images": []
  },
  {
    "title": "青年精英大会",
    "date": "2021-05-15",
    "content": "作为中国计算机学会上海交大学生分会主席，受邀来到沈阳参加青年精英大会。然而会议现场问题频出，论坛内容也乏善可陈，本打算回到本科学校和学弟学妹叙旧，结果突发疫情封锁了校园。本科实验室老师不顾身孕出来和我约饭，非常感动。回到沈阳感觉一切都回到过去时，白天逛一逛辽宁省博物馆的汉代铜镜展，晚上和河北大学、宁波大学的主席们就老雪、鸡架和烤串的经验交流到了凌晨一点，一切都是那么洒脱。唯一不足的是，课程打卡被我定位到了沈阳。",
    "images": [
      {
        "filename": "p87884601.jpg",
        "width": 1080,
        "height": 720,
        "aspectRatio": 1.5
      }
    ]
  },
  {
    "title": "提交了入党申请书",
    "date": "2021-05-20",
    "content": "提交了入党申请书。",
    "images": []
  },
  {
    "title": "智能笔套原型",
    "date": "2021-05-23",
    "content": "用一天的时间独立造了一个可以同步手写文字到电脑端的智能笔套原型，并完成了7页的英文报告。课程老师认为想法很妙，想要和我合作一篇顶会文章，我做一作，他的实验室辅助做实验。然而被我的导师回绝了，理由是这不是我的研究方向。",
    "images": []
  },
  {
    "title": "知乎文章被优质",
    "date": "2021-05-26",
    "content": "将23号实验中遇到的一些问题总结成文章，拿到了知乎的第四篇优质。",
    "images": []
  },
  {
    "title": "打台球",
    "date": "2021-06-04",
    "content": "心情不好，和好兄弟约着打台球，台球技术突飞猛进。",
    "images": []
  },
  {
    "title": "野餐",
    "date": "2021-06-10",
    "content": "和兄弟们在学院门前的草坪上「野餐」，飞无人机、打德州扑克。",
    "images": [
      {
        "filename": "p87884575.jpg",
        "width": 1080,
        "height": 607,
        "aspectRatio": 1.78
      }
    ]
  },
  {
    "title": "丁丁历险记",
    "date": "2021-06-18",
    "content": "买了全套的『丁丁历险记』",
    "images": []
  },
  {
    "title": "摇骰子赌水",
    "date": "2021-06-19",
    "content": "与兄弟们摇骰子赌水，哪是赌水，分明是赌膀胱。",
    "images": []
  },
  {
    "title": "WAIC UP！",
    "date": "2021-07-08",
    "content": "参加2021世界人工智能大会。",
    "images": [
      {
        "filename": "p87884810.jpg",
        "width": 1080,
        "height": 810,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "广州之旅",
    "date": "2021-07-24",
    "content": "在深圳、广州找挚友散心，逛街、打球、射箭，吃了我此生难忘的龙虾盖面，并开始萌生学粤语的念头。此前心情过于抑郁写下了这首『子非鱼』，但见到好友仿佛拨云见日、柳暗花明。",
    "images": [
      {
        "filename": "p87886674.jpg",
        "width": 1080,
        "height": 1440,
        "aspectRatio": 0.75
      }
    ]
  },
  {
    "title": "躲过查帕卡没躲过烟花",
    "date": "2021-07-25",
    "content": "躲过查帕卡没躲过烟花，在台风中冒雨回宿舍，宅了3天。在路上一直走中心线，两边的树有的都被吹倒了。",
    "images": []
  },
  {
    "title": "第一次炒鱿鱼",
    "date": "2021-08-29",
    "content": "第一次炒鱿鱼，技术不熟练，一顿饭做了3个小时。",
    "images": []
  },
  {
    "title": "看升旗仪式",
    "date": "2021-10-01",
    "content": "看升旗仪式，起的太晚，没赶上！",
    "images": []
  },
  {
    "title": "豆苗之死",
    "date": "2021-10-02",
    "content": "在海底捞索要来豆苗割剩下的根茎，养了四五天，本来郁郁葱葱，这天突然横死，遂写诗以寄哀思：豆苗之死。",
    "images": [
      {
        "filename": "p87886750.jpg",
        "width": 1080,
        "height": 810,
        "aspectRatio": 1.33
      }
    ]
  },
  {
    "title": "美学课程",
    "date": "2021-10-04",
    "content": "开始关注西竹书院杨宁老师的美学课程。",
    "images": [
      {
        "filename": "p87886768.jpg",
        "width": 1080,
        "height": 610,
        "aspectRatio": 1.77
      }
    ]
  },
  {
    "title": "租车去洋山码头",
    "date": "2021-10-07",
    "content": "和兄弟们租车去洋山码头，实习期第一次正式上高速飙到100迈。",
    "images": [
      {
        "filename": "p87886805.jpg",
        "width": 1080,
        "height": 607,
        "aspectRatio": 1.78
      }
    ]
  },
  {
    "title": "访问真格基金",
    "date": "2021-10-15",
    "content": "同好兄弟们一同访问真格基金，了解了创业和风险投资一系列知识。",
    "images": []
  },
  {
    "title": "航班退票",
    "date": "2021-10-27",
    "content": "深圳疫情防控导致中国计算机大会取消，为航班退票的事情折腾了一个礼拜，终于在一顿威逼利诱的话术下得到了深圳航空和南方航空的全额退票。经验表明，出差应该提前一天买票，买大公司比如东航的票更加稳妥。",
    "images": []
  },
  {
    "title": "自制神经网络框架",
    "date": "2021-10-30",
    "content": "成功自制神经网络框架，在线性回归问题中取得稳定效果。",
    "images": []
  },
  {
    "title": "华为实习",
    "date": "2021-11-05",
    "content": "进入华为某算法部门实习，开始关注网络攻击检测。",
    "images": []
  },
  {
    "title": "气温跳崖",
    "date": "2021-11-08",
    "content": "气温跳崖，有图为证。期待2022年的降温，好竞选最猛跳崖选手。",
    "images": [
      {
        "filename": "p87886870.jpg",
        "width": 1080,
        "height": 625,
        "aspectRatio": 1.73
      }
    ]
  },
  {
    "title": "研究莫列波纹",
    "date": "2021-11-03",
    "content": "写了一篇讲解莫列波纹的长篇大论，并首次使用纯编程的方式合成了讲解视频。",
    "images": []
  },
  {
    "title": "结识稚晖君",
    "date": "2021-11-17",
    "content": "成功通过华为的渠道结识了稚晖君。从2013年还是化学竞赛生以来就是稚晖君的粉丝，终于追星成功，并和他进入同一个企业。",
    "images": []
  },
  {
    "title": "纪念一二九运动冬季长跑",
    "date": "2021-12-04",
    "content": "纪念一二九运动冬季长跑，终于拿到了纪念奖牌，但也得到了历时一周的鼻炎。",
    "images": []
  },
  {
    "title": "Apache Log4j2漏洞",
    "date": "2021-12-10",
    "content": "Apache Log4j2出现核弹级漏洞，当天进行了漏洞复现并撰写了长文进行评论，首次上知乎热门，相关问题最高赞，24小时突破2w阅读量。说实话，流量让人浮躁。",
    "images": [
      {
        "filename": "p87887057.jpg",
        "width": 664,
        "height": 372,
        "aspectRatio": 1.78
      }
    ]
  },
  {
    "title": "PCAP文件解析",
    "date": "2021-12-15",
    "content": "从底层手写了PCAP文件中以太帧到HTTPS的报文的解析过程，第一次对网络稍有了解。",
    "images": []
  },
  {
    "title": "评价知乎的文章被知乎评价",
    "date": "2021-12-18",
    "content": "在知乎写了一篇评价知乎的文章，想要批判流量让人浮躁这件事，结果又引发17w浏览量，让人更加浮躁了。横竖想不出个办法，打算新一年降低对知乎的关注度，开始专注运营个人网站。",
    "images": []
  },
  {
    "title": "旧货市场、滨江森林公园",
    "date": "2021-12-19",
    "content": "和兄弟们租车去旧货市场以及滨江森林公园，旧货市场确实有很多灰黑产，但总体令人失望。",
    "images": []
  },
  {
    "title": "空降PUA",
    "date": "2021-12-23",
    "content": "遭遇某sb老师的空降PUA，反应过来后被我强硬地怼了回去。虽然没有造成实质性影响，但也让我难受了几个月。",
    "images": []
  },
  {
    "title": "学长邀请吃饭",
    "date": "2021-12-27",
    "content": "『关于之前那篇文章被一个做产品运营的人点了赞，这个点赞的动态又被某个创业公司的猎头看见，进而翻了我的个人网站并破解了我的微信号，从而加上我微信，并发现是校友这件事 』后来被学长邀请到公司吃饭，聊了整整一个下午的创业经验，受益颇深。",
    "images": []
  }
]